{
"translation":{
  "aboutMeTitle": "About Me",
  "aboutMeText": "Hello, my name is Vitor, I was born in 2004 and I'm from Curitiba, the capital of the state of Paraná, in Brazil. Since 2020, I have been living in Portugal and I am loving it here. I have always been passionate about technology and initially, my dream was to develop games, since I have always been a big enthusiast of that world. However, over time, I discovered that my true calling is to develop websites. I have always been fascinated by art and design, and I think that is one of the reasons why I feel so comfortable working with website creation. I am always looking for new challenges and improving my technical skills to always offer the best to my clients.",

  "Projects": "Projects",
  "see more": "see more",
  "Swipe to the side": "Swipe to the side",
  "skilstextcss": "CSS (Cascading Style Sheets) is a style language used to describe the presentation of documents written in HTML (Hypertext Markup Language) or XML (Extensible Markup Language), including colors, layout, fonts and other visual characteristics. CSS separates the presentation from the content of a document, allowing developers to more precisely and consistently control the layout and appearance of a website. With the use of CSS, it is possible to create responsive and accessible designs that adapt to different devices and screen sizes.",
  "skilstexthtml":"HTML (Hypertext Markup Language) is a markup language used to create and structure content for the web. It is the basis of all websites on the internet and allows the creation of web pages, inserting text, images, videos, links and other elements that are displayed in browsers. HTML is made up of tags (tags) that tell the browser how to display the content, and can be styled with CSS and added interactivity with JavaScript.",
  "skilstextjs":"JavaScript is a high-level, interpreted, object-oriented programming language that lets you add interactivity and dynamism to web pages. It runs on the client side, that is, in the user's browser, and can be used to manipulate the content of a page, validate forms, create animations, among other things. JavaScript can also be used on the server side, with Node.js, to build complete web applications. It was created in 1995 by Brendan Eich while working at Netscape and has since become one of the most popular languages ​​in the world.",
  "skilstextreact":"ReactJS is an open source JavaScript library used to create user interfaces with reusable components. It was created by Facebook and is used by companies like Netflix, Airbnb and Instagram. React lets you build dynamic, scalable web apps with a simple and efficient declarative syntax. It also has advanced features like server-side rendering and virtual rendering that help to improve the performance of the application. With React, you can build complex, feature-rich web applications efficiently and in a way that is easy to maintain.",
  "skilsinstruction":"place the cursor or finger above the skills",
  "skilstitle":"Skils",
  "navAboutMe":"About me",
  "navHome":"Home",
  "navSkils":"Skils",
  "navProjects":"Projects",
  "Card1.title":"Website with information and download of the game",
  "Card1.text":"Website made with html, css, php, javascript and sql. With login information about logging in and downloading the game.",
  "Card2.title":"Website with information and download of the game v2",
  "Card2.text":"Website made with react js, css, javascript and node js. With login information about logging in and downloading the game.",
  "Card3.title":"Coming Soon",
  "Card3.text":"Coming Soon",
  "Card4.title":"Coming Soon",
  "Card4.text":"Coming Soon",
  "Card5.title":"Coming Soon",
  "Card5.text":"Coming Soon",
  "Card6.title":"Coming Soon",
  "Card6.text":"Coming Soon",
  "Card7.title":"Coming Soon",
  "Card7.text":"Coming Soon",
  "Card8.title":"Coming Soon",
  "Card8.text":"Coming Soon",
  "ProjTitle1":"Website with information and download of the game",
  "ProjText1":"Website made with html, css, php, javascript and sql. With login information about logg in and downloading the game.",
  "ProjTitle2":"Website with information and download of the game v2",
  "ProjText2":"Website made with react js, css, javascript and node js. With login information about login and downloading the game.",
  "ProjTitle3":"Coming Soon",
  "ProjText3":"Coming Soon",
  "LangOption":"Language",
  "error1":"Come back ",
  "errorbtn":"here"
  }
}