{
    "translation":{
        "aboutMeTitle": "Acerca de mí",
        "aboutMeText": " Hola, mi nombre es Vitor, nací en 2004 y soy natural de Curitiba, capital del estado de Paraná, en Brasil. Desde 2020, vivo en Portugal y estoy encantado de vivir aquí. Siempre he sido apasionado por la tecnología y, inicialmente, mi sueño era desarrollar juegos, ya que siempre he sido un gran entusiasta de ese mundo. Sin embargo, con el tiempo, descubrí que mi verdadera vocación es desarrollar sitios web. Siempre me ha fascinado el arte y el diseño, y creo que esa es una de las razones por las que me siento tan cómodo trabajando en la creación de sitios web. Siempre estoy buscando nuevos desafíos y mejorando mis habilidades técnicas para ofrecer lo mejor a mis clientes.",
        "Projects": "Projectos",
        "see more": "vea mas",
        "Swipe to the side":"desliza hacia un lado",
        "skilstextcss":"CSS (hojas de estilo en cascada) es un lenguaje de estilo utilizado para describir la presentación de documentos escritos en HTML (lenguaje de marcado de hipertexto) o XML (lenguaje de marcado extensible), incluidos los colores, el diseño, las fuentes y otras características visuales. CSS separa la presentación del contenido de un documento, lo que permite a los desarrolladores controlar de manera más precisa y consistente el diseño y la apariencia de un sitio web. Con el uso de CSS es posible crear diseños responsivos y accesibles que se adaptan a diferentes dispositivos y tamaños de pantalla.",
        "skilstexthtml":"HTML (Hypertext Markup Language) es un lenguaje de marcado utilizado para crear y estructurar contenido para la web. Es la base de todos los sitios web en Internet y permite la creación de páginas web, insertando texto, imágenes, videos, enlaces y otros elementos. que se muestran en los navegadores. HTML se compone de etiquetas (tags) que le indican al navegador cómo mostrar el contenido, y se puede diseñar con CSS y agregar interactividad con JavaScript",
        "skilstextjs":"JavaScript es un lenguaje de programación orientado a objetos, interpretado y de alto nivel que le permite agregar interactividad y dinamismo a las páginas web. Se ejecuta del lado del cliente, es decir, en el navegador del usuario, y se puede utilizar para manipular el contenido de una página, validar formularios, crear animaciones, entre otras cosas. JavaScript también se puede usar en el lado del servidor, con Node.js, para crear aplicaciones web completas. Fue creado en 1995 por Brendan Eich mientras trabajaba en Netscape y desde entonces se ha convertido en uno de los lenguajes más populares del mundo.",
        "skilstextreact":"ReactJS es una biblioteca JavaScript de código abierto que se utiliza para crear interfaces de usuario con componentes reutilizables. Fue creado por Facebook y es utilizado por empresas como Netflix, Airbnb e Instagram. React le permite crear aplicaciones web dinámicas y escalables con una sintaxis declarativa simple y eficiente. También cuenta con funciones avanzadas como la representación del lado del servidor y la representación virtual que ayudan a mejorar el rendimiento de la aplicación. Con React, puede crear aplicaciones web complejas y ricas en funciones de manera eficiente y fácil de mantener.",
        "skilsinstruction":"Coloque el cursor o el dedo sobre las habilidades",
        "skilstitle":"Habilidades",
        "navAboutMe":"Acera de mí",
        "navHome":"Casa",
        "navSkils":"Habilidades",
        "navProjects":"Projectos",
        "Card1.title":"Site con descarga e informaciones del juego",
        "Card1.text":"Sitio web realizado con html, css, javascript y sql. Con inicio de sesión información sobre cómo iniciar sesión y descargar el juego",
        "Card2.title":"Site con descarga e informaciones del juego v2",
        "Card2.text":"Sitio web realizado con react js, css, javascript y node js. Con inicio de sesión información sobre  sesión y descargar el juego",
        "Card3.title":"próximamente",
        "Card3.text":"próximamente",
        "Card4.title":"próximamente",
        "Card4.text":"próximamente",
        "Card5.title":"próximamente",
        "Card5.text":"próximamente",
        "Card6.title":"próximamente",
        "Card6.text":"próximamente",
        "Card7.title":"próximamente",
        "Card7.text":"próximamente",
        "Card8.title":"próximamente",
        "Card8.text":"próximamente",
        "ProjTitle1":"Site con descarga e informaciones del juego",
        "ProjText1":"Sitio web realizado con html, css, javascript y sql. Con inicio de sesión información sobre  sesión y descargar el juego",
        "ProjTitle2":"Site con descarga e informaciones del juego v2",
        "ProjText2":"Sitio web realizado con react js, css, javascript y node js. Con inicio de sesión información sobre  sesión y descargar el juego",
        "ProjTitle3":"Próximamente",
        "ProjText3":"Próximamente",
        "LangOption":"Idioma",
        "error1":"Regresse  ",
        "errorbtn":"aqui"
        }
  }
