{
  "translation":{
  "aboutMeTitle": "Sobre Mim",
  "aboutMeText": " Olá, meu nome é Vitor, nasci em 2004 e sou natural de Curitiba,capital do estado do Paraná, no Brasil. Desde 2020, moro em  Portugal e estou adorando viver aqui. Sempre fui apaixonado portecnologia e, inicialmente, meu sonho era desenvolver jogos, já que sempre fui um grande entusiasta desse mundo. No entanto, ao  longo do tempo, descobri que minha verdadeira vocação é desenvolver sites. Sempre fui fascinado por arte e design, e acho que essa é uma das razões pelas quais me sinto tão à vontade trabalhando com criação de sites. Estou sempre em busca de novos  desafios e aprimorando minhas habilidades técnicas para oferecer  sempre o melhor para meus clientes.",
  "Projects": "Projetos",
  "see more": "veja mais",
  "Swipe to the side": "Arraste para o lado",
  "skilstextcss":"CSS (Cascading Style Sheets) é uma linguagem de estilo utilizada para descrever a apresentação de documentos escritos em HTML (Hypertext Markup Language) ou XML (Extensible Markup Language), incluindo cores, layout, fontes e outras características visuais. O CSS separa a apresentação do conteúdo de um documento, permitindo que os desenvolvedores controlem o layout e a aparência de um site de maneira mais precisa e consistente. Com o uso de CSS, é possível criar designs responsivos e acessíveis, que se adaptam a diferentes dispositivos e tamanhos de tela.",
  "skilstexthtml":"HTML (Hypertext Markup Language) é uma linguagem de marcação usada para criar e estruturar conteúdo para a web. É a base de todos os sites na internet e permite a criação de páginas web, inserindo texto, imagens, vídeos, links e outros elementos que são exibidos nos navegadores. O HTML é composto de tags (etiquetas) que indicam ao navegador como exibir o conteúdo, e pode ser estilizado com CSS e adicionado interatividade com JavaScript.",
  "skilstextjs":"JavaScript é uma linguagem de programação de alto nível, interpretada e orientada a objetos, que permite adicionar interatividade e dinamismo a páginas web. Ela é executada no lado do cliente, ou seja, no navegador do usuário, e pode ser utilizada para manipular o conteúdo de uma página, validar formulários, criar animações, entre outras coisas. O JavaScript também pode ser usado no lado do servidor, com o Node.js, para construir aplicações web completas. Ele foi criado em 1995 por Brendan Eich, enquanto trabalhava na Netscape, e desde então se tornou uma das linguagens mais populares do mundo.",
  "skilstextreact":"ReactJS é uma biblioteca JavaScript de código aberto usada para criar interfaces de usuário com componentes reutilizáveis. Ele foi criado pelo Facebook e é usado por empresas como Netflix, Airbnb e Instagram. O React permite criar aplicativos da web dinâmicos e escaláveis com uma sintaxe declarativa simples e eficiente. Ele também possui recursos avançados, como renderização do lado do servidor e renderização virtual, que ajudam a melhorar o desempenho do aplicativo. Com o React, é possível criar aplicativos da web complexos e ricos em recursos de maneira eficiente e fácil de manter.",
  "skilsinstruction":"Posicione o cursor ou o dedo acima das habilidades",
  "skilstitle":"Habilidades",
  "navAboutMe":"Sobre mim",
  "navHome":"Inicio",
  "navSkils":"Habilidades",
  "navProjects":"Projetos",
  "Card1.title":"Site com informações e Download de jogo",
  "Card1.text":"Site feito com html, css, php, javascript e sql. Com Login informações sobre o login e download do jogo.",
  "Card2.title":"Site com informações e Download de jogo v2",
  "Card2.text":"Site feito com react js, css, javascript e node js. Com Login informações sobre o login e download do jogo.",
  "Card3.title":"Em Breve",
  "Card3.text":"Em Breve",
  "Card4.title":"Em Breve",
  "Card4.text":"Em Breve",
  "Card5.title":"Em Breve",
  "Card5.text":"Em Breve",
  "Card6.title":"Em Breve",
  "Card6.text":"Em Breve",
  "Card7.title":"Em Breve",
  "Card7.text":"Em Breve",
  "Card8.title":"Em Breve",
  "Card8.text":"Em Breve",
  "ProjTitle1":" Site com informações e Download de jogo",
  "ProjText1":"Site feito com html, css, javascript e sql. Com Login informações sobre o login e download do jogo.",
  "ProjTitle2":"Site com informações e Download de jogo v2",
  "ProjText2":"Site feito com react js, css, javascript e node js. Com Login ,informações sobre o login e download do jogo.",
  "ProjTitle3":"Em Breve",
  "ProjText3":"Em Breve",
  "LangOption":"Idioma",
  "error1":"volte ",
  "errorbtn":"aqui"

  }
}